Repository: kodi-game/game.libretro.fmsx
Catalog: game.libretro.fmsx/resources/language/resource.language.*/strings.po
Languages: es_es, ga, sv_se, zh_cn

# Addon Description
source: fMSX is a MSX emulator written by Marat Fayzullin. It emulates MSX, MSX2, and MSX2+ 8-bit home computers.
es_es: fMSX es un emulador de MSX escrito por Marat Fayzullin. Emula ordenadores domésticos de 8 bits MSX, MSX2 y MSX2+.
ga: Is aithriseoir MSX é fMSX a scríobh Marat Fayzullin. Déanann sé aithris ar ríomhairí baile 8-giotán MSX, MSX2, agus MSX2+.
sv_se: fMSX är en MSX-emulator skriven av Marat Fayzullin. Den emulerar MSX, MSX2 och MSX2+ 8-bitars hemdatorer.
zh_cn: fMSX 是由 Marat Fayzullin 编写的 MSX 模拟器。它模拟 MSX、MSX2 和 MSX2+ 8位家用计算机。

# Addon Disclaimer
source: Image credit: Garage Research Emulators
es_es: Créditos de la imagen: Garage Research Emulators
ga: Creidmheas íomhá: Aithriseoirí Taighde Garáiste
sv_se: Bild: Garage Research Emulators
zh_cn: 图片来源：Garage Research 模拟器

# #30001
source: MSX Mode
es_es: Modo MSX
ga: Mód MSX
sv_se: MSX-läge
zh_cn: MSX 模式

# #30002
source: MSX Video Mode
es_es: Modo de Vídeo MSX
ga: Mód Físe MSX
sv_se: MSX-videoläge
zh_cn: MSX 视频模式

# #30003
source: Support high resolution
es_es: Admite Alta Resolución
ga: Tacaigh le réiteach ard
sv_se: Stöd för hög upplösning
zh_cn: 支持高分辨率

# #30004
source: Support overscan
es_es: Admite Overscan
ga: Tacaíocht ró-scanadh
zh_cn: 支持过扫描

# #30005
source: MSX Mapper Type Mode
es_es: Modo de Escritura del Mapeador MSX
ga: Mód Cineál Mapálaí MSX
zh_cn: MSX 映射器类型模式

# #30006
source: MSX Main Memory
es_es: Memoria Principal MSX
ga: Príomhchuimhne MSX
sv_se: MSX huvudminne
zh_cn: MSX 主内存

# #30007
source: MSX Video Memory
es_es: Memoria de Vídeo MSX
ga: Cuimhne Físe MSX
sv_se: MSX videominne
zh_cn: MSX 视频内存

# #30008
source: Enable SCC-I 128kB MegaRAM
es_es: Activar SCC-I 128kB MegaRAM
ga: Cumasaigh MegaRAM SCC-I 128kB

# #30009
source: fMSX logging
es_es: Registro fMSX
ga: logáil fMSX
sv_se: fMSX-loggning

# #30010
source: Support Game Master
es_es: Director de Juego de Apoyo
ga: Tacaíocht Cluiche Máistir

# #30011
source: Simulate DiskROM disk access calls
es_es: Simular llamadas de acceso al disco DiskROM
ga: Insamhladh glaonna rochtana diosca DiskROM

# #30012
source: Use autofire on SPACE
es_es: Usar disparo automático con ESPACIO
ga: Úsáid uath-tine ar SPÁS
sv_se: Använd autofire med MELLANSLAG

# #30013
source: Show all sprites
es_es: Mostrar todos los sprites
ga: Taispeáin na sprideanna go léir
sv_se: Visa alla sprites

# #30014
source: Text font
es_es: Fuente del texto
ga: Cló téacs
sv_se: Teckensnitt för text

# #30015
source: Save disk changes
es_es: Guardar cambios en el disco
ga: Sábháil athruithe ar an diosca
sv_se: Spara diskändringar

# #30016
source: Create empty disk when none loaded
es_es: Crear disco vacío cuando no hay ninguno cargado
ga: Cruthaigh diosca folamh nuair nach bhfuil aon cheann luchtaithe

# #30017
source: Load MSXDOS2.ROM when found
es_es: Cargar MSXDOS2.ROM cuando se encuentre
ga: Luchtaigh MSXDOS2.ROM nuair a aimsítear é
sv_se: Läs in MSXDOS2.ROM när den hittas

# #30018
source: Custom keyboard RetroPad up
es_es: Teclado personalizado RetroPad arriba
ga: Méarchlár saincheaptha RetroPad suas
sv_se: Anpassat tangentbord RetroPad upp

# #30019
source: Custom keyboard RetroPad down
es_es: Teclado personalizado RetroPad abajo
ga: Méarchlár saincheaptha RetroPad síos
sv_se: Anpassat tangentbord RetroPad ner

# #30020
source: Custom keyboard RetroPad left
es_es: Teclado personalizado RetroPad izquierda
ga: Méarchlár saincheaptha RetroPad ar chlé
sv_se: Anpassat tangentbord RetroPad vänster

# #30021
source: Custom keyboard RetroPad right
es_es: Teclado personalizado RetroPad derecha
ga: Méarchlár saincheaptha RetroPad ar dheis
sv_se: Anpassat tangentbord RetroPad höger

# #30022
source: Custom keyboard RetroPad a
es_es: Teclado personalizado RetroPad a
ga: Méarchlár saincheaptha RetroPad a
sv_se: Anpassat tangentbord RetroPad a

# #30023
source: Custom keyboard RetroPad b
es_es: Teclado personalizado RetroPad b
ga: Méarchlár saincheaptha RetroPad b
sv_se: Anpassat tangentbord RetroPad b

# #30024
source: Custom keyboard RetroPad y
es_es: Teclado personalizado RetroPad y
ga: Méarchlár saincheaptha RetroPad y
sv_se: Anpassat tangentbord RetroPad y

# #30025
source: Custom keyboard RetroPad x
es_es: Teclado personalizado RetroPad x
ga: Méarchlár saincheaptha RetroPad x
sv_se: Anpassat tangentbord RetroPad x

# #30026
source: Custom keyboard RetroPad start
es_es: Teclado personalizado RetroPad start
ga: Méarchlár saincheaptha RetroPad Tús
sv_se: Anpassat tangentbord RetroPad start

# #30027
source: Custom keyboard RetroPad select
es_es: Teclado personalizado RetroPad select
ga: Méarchlár saincheaptha RetroPad Roghnaigh
sv_se: Anpassat tangentbord RetroPad select

# #30028
source: Custom keyboard RetroPad l
es_es: Teclado personalizado RetroPad l
ga: Méarchlár saincheaptha RetroPad l
sv_se: Anpassat tangentbord RetroPad l

# #30029
source: Custom keyboard RetroPad r
es_es: Teclado personalizado RetroPad r
ga: Méarchlár saincheaptha RetroPad r
sv_se: Anpassat tangentbord RetroPad r

# #30030
source: Custom keyboard RetroPad l2
es_es: Teclado personalizado RetroPad l2
ga: Méarchlár saincheaptha RetroPad 12
sv_se: Anpassat tangentbord RetroPad l2

# #30031
source: Custom keyboard RetroPad r2
es_es: Teclado personalizado RetroPad r2
ga: Méarchlár saincheaptha RetroPad r2
sv_se: Anpassat tangentbord RetroPad r2

# #30032
source: Custom keyboard RetroPad l3
es_es: Teclado personalizado RetroPad l3
ga: Méarchlár saincheaptha RetroPad l3
sv_se: Anpassat tangentbord RetroPad l3

# #30033
source: Custom keyboard RetroPad r3
es_es: Teclado personalizado RetroPad r3
ga: Méarchlár saincheaptha RetroPad r3
sv_se: Anpassat tangentbord RetroPad r3

# #30034
source: YM2413 (FM-PAC / MSX-MUSIC) core
es_es: Core YM2413 (FM-PAC / MSX-MUSIC)
ga: Croílár YM2413 (FM-PAC / MSX-MUSIC)
sv_se: YM2413-kärna (FM-PAC / MSX-MUSIC)

# #30000
source: Settings
zh_cn: 设置

# #30008
source: fMSX logging
zh_cn: fMSX 日志记录

# #30009
source: Support Game Master
zh_cn: 支持游戏修改大师

# #30010
source: Simulate DiskROM disk access calls
zh_cn: 模拟 DiskROM 磁盘访问调用

# #30011
source: Use autofire on SPACE
zh_cn: SPACE 键使用自动开火

# #30012
source: Show all sprites
zh_cn: 显示所有精灵

# #30013
source: Text font
zh_cn: 文本字体

# #30014
source: Save disk changes
zh_cn: 保存磁盘更改

# #30015
source: Create empty disk when none loaded
zh_cn: 未加载时创建空磁盘

# #30016
source: Custom keyboard RetroPad up
zh_cn: 自定义键盘 RetroPad 上

# #30017
source: Custom keyboard RetroPad down
zh_cn: 自定义键盘 RetroPad 下

# #30018
source: Custom keyboard RetroPad left
zh_cn: 自定义键盘 RetroPad 左

# #30019
source: Custom keyboard RetroPad right
zh_cn: 自定义键盘 RetroPad 右

# #30020
source: Custom keyboard RetroPad a
zh_cn: 自定义键盘 RetroPad a

# #30021
source: Custom keyboard RetroPad b
zh_cn: 自定义键盘 RetroPad b

# #30022
source: Custom keyboard RetroPad y
zh_cn: 自定义键盘 RetroPad y

# #30023
source: Custom keyboard RetroPad x
zh_cn: 自定义键盘 RetroPad x

# #30024
source: Custom keyboard RetroPad start
zh_cn: 自定义键盘 RetroPad start

# #30025
source: Custom keyboard RetroPad select
zh_cn: 自定义键盘 RetroPad select

# #30026
source: Custom keyboard RetroPad l
zh_cn: 自定义键盘 RetroPad l

# #30027
source: Custom keyboard RetroPad r
zh_cn: 自定义键盘 RetroPad r

# #30028
source: Custom keyboard RetroPad l2
zh_cn: 自定义键盘 RetroPad l2

# #30029
source: Custom keyboard RetroPad r2
zh_cn: 自定义键盘 RetroPad r2

# #30030
source: Custom keyboard RetroPad l3
zh_cn: 自定义键盘 RetroPad l3

# #30031
source: Custom keyboard RetroPad r3
zh_cn: 自定义键盘 RetroPad r3
